#Напишите пример любого класса и создайте его объект

class Anyclass:

    def func(self):
        print('new_object')
new_object = Anyclass()
new_object.func()
